{
    "id": "5a45de7f-f821-4ac4-aed7-9c7fe29b516a",
    "url": "https://www.bbc.com/news/articles/c4g8r23yv71o?at_medium=RSS&at_campaign=rss",
    "title": "Why fake AI videos of UK urban decline are taking over social media",
    "category": "BBC News",
    "publication_date": "Sat, 21 Feb 2026 06:04:41 GMT",
    "collected_at": "2026-02-26T16:59:55.360569",
    "clean_text": "An AI-generated video shows a crowd of young - mostly black - men, wearing balaclavas and padded jackets, slipping down a water slide into a dirty swimming pool with litter bobbing on the surface. The caption describes the scene as a taxpayer-funded water park in Croydon. It is one of a wave of deepfakes showing often absurd scenes of urban decline, and regularly purporting to be in the same south London neighbourhood. Dozens of copycat accounts have begun producing similar content and collectively they have racked up millions of views across TikTok and Instagram Reels. These fake videos have become part of a much wider trend - where online influencers and content creators portray Western cities such as London, Manchester, San Francisco or New York as overrun with immigrants and crime. It has been dubbed \"decline porn\". These narratives - often exaggerated or fabricated, some obviously satirical - are fuelling anger and racist backlash among some viewers who take them at face value. The BBC tracked down the originator of the Croydon AI videos for the new podcast Top Comment, which investigates the stories behind our social media feeds. What we found was a new brand of online faker, who thrives off engagement and shrugs off responsibility for how the content can be used to push divisive political narratives. The shame around posting fakes seems to have gone completely out of the window. The creator, who uses the online handle RadialB, says he didn't expect to spawn copycats or be politically provocative. He says his content is intended to be funny - but that he also wants people to believe his fake scenes are real to grab their attention. \"If people saw it and they immediately knew it was fake, then they would just scroll. The selling point of generative AI models is that they look real,\" RadialB tells me over the phone. He refuses to share his real name but reveals he is in his 20s and from the north-west of England. He has never been to Croydon. He tells me the creation of the AI water park, zoo and aquarium in Croydon was \"just part of the progression of things getting more and more funny or absurd\". Several of the videos \"blew up\", he says, because they were very graphic, showing people flying off slides. The young men in his videos are \"roadmen\", a slang term for urban youth, often associated with drug dealing, he says, and are \"cultural archetypes\" that he frequently features in his videos. One post portraying roadmen in Parliament got eight million views in a day, he says. When asked about the racism that his videos sometimes provoke in the comments, he says: \"I don't deny it\", but adds that \"comments get filtered\", meaning that social media platforms delete racist remarks. TikTok, Instagram and X all have policies prohibiting racist abuse. RadialB says when he generates the AI content he doesn't intend for the people portrayed to be a certain race or ethnicity, but just uses the prompt \"roadmen wearing puffer jackets, track suits, and balaclavas\" because that makes the \"funniest\" characters. While he disavows any political intent, his videos portray absurd \"taxpayer-funded\" facilities. He says \"English politics is a bit of a parasitic cesspit\" and suggests \"we replace them all with roadmen\". Several of the videos feature small labels saying they are \"AI-generated\" or contain \"synthetic media\", in line with Tiktok, Instagram and X's policies on AI media, but some people who had left comments told us they had been genuinely convinced by the posts. RadialB acknowledges the videos provoke political reactions: \"I could put stuff up and there would be like 50-year-olds and 60-year-olds in the comments raging and saying all this political stuff.\" But he suggests some of the comments are ironic. Other users have objected to this wave of AI slop videos as an unfair racial stereotype of their neighbourhood. One black TikTok user from Croydon called C.Tino posted a response, saying the trend falsely portrayed the area as \"ghetto\".  \"These videos are making people think this is real life. It's becoming out of hand now,\" he said. RadialB says he was able to start making this content because of the \"huge jump\" in the quality and availability of AI tools. It \"hugely lowers the barrier for entry\" for anyone who wants to make \"fake stuff\", he says. He says a lot of the accounts re-sharing his posts are likely doing it for views and clicks - and in an effort to monetise the content on other platforms like Facebook. Users as far away as Israel and Brazil said they shared the videos because they \"got engagement\" or to \"join in on the trend\". Several other accounts posting in Arabic, and that appear to be based in the Middle East, have also shared multiple videos about London being in decline - including the ones of Croydon. I have also found several TikTok profiles that purport to be British news accounts, which only share either these kinds of AI-generated videos about London or other negative content about cities in the UK and US. The deepfakes fit into an existing trend of videos presenting European and American cities as falling into urban decay because of crime and immigration. Sometimes they show real examples of phone-snatching, homelessness, graffiti or drug problems, but omit any wider context.  Increasingly, though, they use AI to distort reality. South African YouTuber Kurt Caz has built an audience of more than four million subscribers by posting travel videos with titles such as \"Attacked by thieves in Barcelona!\" and \"Threatened in the UK's worst town!\" But after posting a recent video, called \"Avoid this place in London\", he was accused of using AI to doctor the thumbnail to bolster his portrayal of the UK capital as one of \"the most messed up cities\" he has ever been to. It showed a man on a bike in a balaclava, in front of shop signs written in Arabic.  But in the video itself, the signs on Croydon's North End are in English, the cyclist has no balaclava and Caz is giving him the thumbs up after a friendly chat.  On X, Kurt Caz dismissed criticism of the thumbnail as \"clickbait\" and said \"if you're going to do a hit piece on me do it properly\". These ideas of the UK and Europe in decline have also been taken up by high-profile, influential figures, including X, Tesla and Space X owner Elon Musk, who spoke at far-right activist Tommy Robinson's Unite the Kingdom rally last year. \"What I see happening is a destruction of Britain. Initially a slow erosion, but a rapidly increasing erosion of Britain with massive uncontrolled migration,\" said Musk. It is a topic he regularly posts about on his X profile, with more than 230 million followers. While there are legitimate debates to be had about immigration and crime, a lot of this content goes beyond the evidence available in reality. In January, pollster YouGov released new data suggesting a majority of Britons now believe London is unsafe, but only a third of people surveyed in the capital agreed - and 81% of them said their own local area was safe. But RadialB says his intention was not to become a \"decline porn\" influencer - and instead just wants to make people laugh with a sort of \"artform\" that games the recommendation systems. He appears to wash his hands of responsibility for how his content may be used or copied. His account on TikTok was banned for sharing content that was detected as graphic or inappropriate, he says. But he has now set up a new account sharing the same kinds of videos, showing \"roadmen\" at grubby \"infinity pools\" and \"taxpayer-funded buffets\".",
    "raw_html": "<article><div class=\"sc-9cd5bb24-0 cmjZrf\" data-component=\"headline-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 gmICnp\"><h1 class=\"sc-f98b1ad2-0 idLnWK\">Why fake AI videos of UK urban decline are taking over social media</h1></div></div></div><div class=\"sc-9cd5bb24-0 CzlrX\" data-component=\"byline-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 gmICnp\"><div class=\"sc-3adb3607-0 fkltMW\" data-testid=\"byline\"><div class=\"sc-3adb3607-1 irDEMC\"><time class=\"sc-3adb3607-2 dXwGZV\" datetime=\"2026-02-21T06:04:41.948Z\">5 days ago</time><div class=\"sc-3adb3607-3 eRBRQb\"><button aria-label=\"Share\" class=\"sc-28fdc07f-2 sc-28fdc07f-5 sc-28fdc07f-6 fQbEOM dSGHyC kuBZLr\" disabled=\"\" type=\"button\"><span class=\"sc-28fdc07f-0 sjpOl\" data-testid=\"button-icon-wrapper\"><svg aria-hidden=\"true\" category=\"social\" class=\"sc-583246d7-0 jUqtCV\" height=\"14\" icon=\"share\" viewbox=\"0 0 12 14\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\"><path clip-rule=\"evenodd\" d=\"M9.51768 8.96851C8.95518 8.96851 8.44393 9.19851 8.07227 9.57018L4.19727 7.36685C4.24893 7.18768 4.2856 7.00185 4.2856 6.80685C4.2856 6.61102 4.24977 6.42518 4.19893 6.2456L8.06143 4.04935C8.43393 4.42602 8.94977 4.66102 9.51768 4.66102C10.661 4.66102 11.5852 3.73643 11.5852 2.60893C11.5852 1.46518 10.661 0.541016 9.51768 0.541016C8.38977 0.541016 7.4656 1.46518 7.4656 2.60893C7.4656 2.78727 7.49602 2.95768 7.53935 3.12352L3.70727 5.37643C3.33143 4.98477 2.80477 4.73935 2.2181 4.73935C1.09018 4.73935 0.166016 5.6631 0.166016 6.80685C0.166016 7.93476 1.09018 8.85851 2.2181 8.85851C2.8006 8.85851 3.32435 8.61726 3.69977 8.23268L7.54602 10.4943C7.49893 10.6681 7.4656 10.8473 7.4656 11.036C7.4656 12.1639 8.38977 13.0881 9.51768 13.0881C10.661 13.0881 11.5852 12.1639 11.5852 11.036C11.5852 9.89268 10.661 8.96851 9.51768 8.96851\" fill-rule=\"evenodd\"></path></svg></span><span aria-hidden=\"false\" class=\"sc-28fdc07f-1 fpFxhF\" data-testid=\"button-text\">Share</span></button><button aria-label=\"Save\" class=\"sc-28fdc07f-2 sc-28fdc07f-5 sc-28fdc07f-6 ejnpYO dWrhlh kycDtY\" data-action=\"save\" disabled=\"\" type=\"button\"><span class=\"sc-28fdc07f-0 sjpOl\" data-testid=\"button-icon-wrapper\"><svg aria-hidden=\"true\" category=\"account\" class=\"sc-583246d7-0 jUqtCV\" height=\"32\" icon=\"saved-items-outlined\" viewbox=\"0 0 12 14\" width=\"32\"><path d=\"M5.99996 9.43351L9.46496 11.0741L9.46496 2.0125L2.53496 2.0125L2.53496 11.0741L5.99996 9.43351ZM0.959961 13.5625L0.959961 0.4375L11.04 0.4375L11.04 13.5625L5.99996 11.1761L0.959961 13.5625Z\" fill=\"currentColor\"></path></svg></span><span aria-hidden=\"false\" class=\"sc-28fdc07f-1 fpFxhF\" data-testid=\"button-text\">Save</span></button></div></div><span class=\"sc-3adb3607-12 csUdlZ\" data-testid=\"byline-contributors\"><div class=\"sc-3adb3607-5 iMnQuR\" data-testid=\"byline-contributors-contributor-0\"><div class=\"sc-3adb3607-7 echTHp\"><span class=\"sc-3adb3607-8 dcphMW\">Marianna Spring</span><span class=\"sc-3adb3607-9 dRohlg\" data-testid=\"byline-contributors-contributor-0-role-location\">Social media investigations correspondent</span></div></div></span><div class=\"sc-3adb3607-4 cLYxKv\"><button aria-label=\"Share\" class=\"sc-28fdc07f-2 sc-28fdc07f-5 sc-28fdc07f-6 fQbEOM dSGHyC kuBZLr\" disabled=\"\" type=\"button\"><span class=\"sc-28fdc07f-0 sjpOl\" data-testid=\"button-icon-wrapper\"><svg aria-hidden=\"true\" category=\"social\" class=\"sc-583246d7-0 jUqtCV\" height=\"14\" icon=\"share\" viewbox=\"0 0 12 14\" width=\"12\" xmlns=\"http://www.w3.org/2000/svg\"><path clip-rule=\"evenodd\" d=\"M9.51768 8.96851C8.95518 8.96851 8.44393 9.19851 8.07227 9.57018L4.19727 7.36685C4.24893 7.18768 4.2856 7.00185 4.2856 6.80685C4.2856 6.61102 4.24977 6.42518 4.19893 6.2456L8.06143 4.04935C8.43393 4.42602 8.94977 4.66102 9.51768 4.66102C10.661 4.66102 11.5852 3.73643 11.5852 2.60893C11.5852 1.46518 10.661 0.541016 9.51768 0.541016C8.38977 0.541016 7.4656 1.46518 7.4656 2.60893C7.4656 2.78727 7.49602 2.95768 7.53935 3.12352L3.70727 5.37643C3.33143 4.98477 2.80477 4.73935 2.2181 4.73935C1.09018 4.73935 0.166016 5.6631 0.166016 6.80685C0.166016 7.93476 1.09018 8.85851 2.2181 8.85851C2.8006 8.85851 3.32435 8.61726 3.69977 8.23268L7.54602 10.4943C7.49893 10.6681 7.4656 10.8473 7.4656 11.036C7.4656 12.1639 8.38977 13.0881 9.51768 13.0881C10.661 13.0881 11.5852 12.1639 11.5852 11.036C11.5852 9.89268 10.661 8.96851 9.51768 8.96851\" fill-rule=\"evenodd\"></path></svg></span><span aria-hidden=\"false\" class=\"sc-28fdc07f-1 fpFxhF\" data-testid=\"button-text\">Share</span></button><button aria-label=\"Save\" class=\"sc-28fdc07f-2 sc-28fdc07f-5 sc-28fdc07f-6 ejnpYO dWrhlh kycDtY\" data-action=\"save\" disabled=\"\" type=\"button\"><span class=\"sc-28fdc07f-0 sjpOl\" data-testid=\"button-icon-wrapper\"><svg aria-hidden=\"true\" category=\"account\" class=\"sc-583246d7-0 jUqtCV\" height=\"32\" icon=\"saved-items-outlined\" viewbox=\"0 0 12 14\" width=\"32\"><path d=\"M5.99996 9.43351L9.46496 11.0741L9.46496 2.0125L2.53496 2.0125L2.53496 11.0741L5.99996 9.43351ZM0.959961 13.5625L0.959961 0.4375L11.04 0.4375L11.04 13.5625L5.99996 11.1761L0.959961 13.5625Z\" fill=\"currentColor\"></path></svg></span><span aria-hidden=\"false\" class=\"sc-28fdc07f-1 fpFxhF\" data-testid=\"button-text\">Save</span></button></div></div></div></div></div><div class=\"sc-9cd5bb24-0 jTWPCV\" data-component=\"image-block\"><figure class=\"sc-cd6075cf-0 laOREU\"><div class=\"sc-82b3c53b-0 ciXMDU\"><div class=\"sc-5340b511-1 cMIbKV\" data-testid=\"hero-image\"><img aria-label=\"image unavailable\" class=\"sc-5340b511-0 gUePlo hide-when-no-script\" src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20260220-084609-e0c5de56b9-web-2.40.1-3/grey-placeholder.png\"/><img alt=\"BBC A composite image showing a graphic of a phone with an image of a young black man wearing a black balaclava and a gold chain shouting and raising his hands. In the background is a still from an AI video showing a waterslide with a red dinghy sliding down it into dirty water, with tower blocks and a crowd of young men in hoodies and balaclavas.\" class=\"sc-5340b511-0 hLdNfA\" loading=\"eager\" sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/0790/live/1b6e53d0-0e6f-11f1-b048-c9424b2cf5fd.png.webp\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/0790/live/1b6e53d0-0e6f-11f1-b048-c9424b2cf5fd.png.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/0790/live/1b6e53d0-0e6f-11f1-b048-c9424b2cf5fd.png.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/0790/live/1b6e53d0-0e6f-11f1-b048-c9424b2cf5fd.png.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/0790/live/1b6e53d0-0e6f-11f1-b048-c9424b2cf5fd.png.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/0790/live/1b6e53d0-0e6f-11f1-b048-c9424b2cf5fd.png.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/0790/live/1b6e53d0-0e6f-11f1-b048-c9424b2cf5fd.png.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/0790/live/1b6e53d0-0e6f-11f1-b048-c9424b2cf5fd.png.webp 1536w\"/><span class=\"sc-5340b511-2 jVqbAn\">BBC</span></div></div></figure></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">An AI-generated video shows a crowd of young - mostly black - men, wearing balaclavas and padded jackets, slipping down a water slide into a dirty swimming pool with litter bobbing on the surface. The caption describes the scene as a taxpayer-funded water park in Croydon.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">It is one of a wave of deepfakes showing often absurd scenes of urban decline, and regularly purporting to be in the same south London neighbourhood. Dozens of copycat accounts have begun producing similar content and collectively they have racked up millions of views across TikTok and Instagram Reels.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">These fake videos have become part of a much wider trend - where online influencers and content creators portray Western cities such as London, Manchester, San Francisco or New York as overrun with immigrants and crime.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">It has been dubbed \"decline porn\". These narratives - often exaggerated or fabricated, some obviously satirical - are fuelling anger and racist backlash among some viewers who take them at face value.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">The BBC tracked down the originator of the Croydon AI videos for the new podcast <a class=\"sc-f9178328-0 iCaRzc\" href=\"https://www.bbc.co.uk/sounds/play/p0n20jy1\" target=\"_self\">Top Comment</a>, which investigates the stories behind our social media feeds. What we found was a new brand of online faker, who thrives off engagement and shrugs off responsibility for how the content can be used to push divisive political narratives.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">The shame around posting fakes seems to have gone completely out of the window.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">The creator, who uses the online handle RadialB, says he didn't expect to spawn copycats or be politically provocative. He says his content is intended to be funny - but that he also wants people to believe his fake scenes are real to grab their attention.</p></div></div></div><div class=\"sc-9cd5bb24-0 iLXgbm\" data-component=\"advertisement-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 fAzFNb\"><div class=\"sc-66bf5539-1 bJFWOK\" data-component=\"ad-slot\" data-testid=\"ad-unit\"><div class=\"dotcom-ad\" data-testid=\"dotcom-mid_1\" id=\"dotcom-mid_1\"></div></div></div></div></div><div class=\"sc-9cd5bb24-0 hoFfRa\" data-component=\"image-block\"><figure class=\"sc-cd6075cf-0 laOREU\"><div class=\"sc-82b3c53b-0 gmICnp\"><div class=\"sc-5340b511-1 cMIbKV\" data-testid=\"image\"><img aria-label=\"image unavailable\" class=\"sc-5340b511-0 gUePlo hide-when-no-script\" src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20260220-084609-e0c5de56b9-web-2.40.1-3/grey-placeholder.png\"/><img alt='A composite image showing stills from three TikTok videos, the first on the left showing \"Croydon Water Park\" with a red dinghy entering the murky water from a grey water slide, while a crowd of young men in dark clothing gather behind with tower blocks in the distance. The second, \"Croydon Arcade Machine\", shows a young black man wearing a balaclava and a padded jacket operating an arcade claw machine to try and grab one of several large knives. The third, another \"Croydon Water Slide\", shows a line of young men in black hoods sliding into the water of a rusty pool, with litter and cans bobbing around.' class=\"sc-5340b511-0 hLdNfA\" loading=\"lazy\" sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5b11/live/102c0b80-0e5f-11f1-801d-ed3cff6bf876.jpg.webp\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5b11/live/102c0b80-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/5b11/live/102c0b80-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/5b11/live/102c0b80-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/5b11/live/102c0b80-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/5b11/live/102c0b80-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/5b11/live/102c0b80-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/5b11/live/102c0b80-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 1536w\"/></div></div><div class=\"sc-82b3c53b-0 gmICnp\"><figcaption class=\"sc-536eff7b-0 gnQokQ\">RadialB's fake videos portray grimy Croydon waterparks and an arcade machine filled with knives</figcaption></div></figure></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">\"If people saw it and they immediately knew it was fake, then they would just scroll. The selling point of generative AI models is that they look real,\" RadialB tells me over the phone. He refuses to share his real name but reveals he is in his 20s and from the north-west of England. He has never been to Croydon.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">He tells me the creation of the AI water park, zoo and aquarium in Croydon was \"just part of the progression of things getting more and more funny or absurd\". Several of the videos \"blew up\", he says, because they were very graphic, showing people flying off slides.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">The young men in his videos are \"roadmen\", a slang term for urban youth, often associated with drug dealing, he says, and are \"cultural archetypes\" that he frequently features in his videos. One post portraying roadmen in Parliament got eight million views in a day, he says.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">When asked about the racism that his videos sometimes provoke in the comments, he says: \"I don't deny it\", but adds that \"comments get filtered\", meaning that social media platforms delete racist remarks. TikTok, Instagram and X all have policies prohibiting racist abuse.</p></div></div></div><div class=\"sc-9cd5bb24-0 iLXgbm\" data-component=\"advertisement-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 fAzFNb\"><div class=\"sc-66bf5539-1 bJFWOK\" data-component=\"ad-slot\" data-testid=\"ad-unit\"><div class=\"dotcom-ad\" data-testid=\"dotcom-mid_2\" id=\"dotcom-mid_2\"></div></div></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">RadialB says when he generates the AI content he doesn't intend for the people portrayed to be a certain race or ethnicity, but just uses the prompt \"roadmen wearing puffer jackets, track suits, and balaclavas\" because that makes the \"funniest\" characters.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">While he disavows any political intent, his videos portray absurd \"taxpayer-funded\" facilities. He says \"English politics is a bit of a parasitic cesspit\" and suggests \"we replace them all with roadmen\".</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">Several of the videos feature small labels saying they are \"AI-generated\" or contain \"synthetic media\", in line with Tiktok, Instagram and X's policies on AI media, but some people who had left comments told us they had been genuinely convinced by the posts.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">RadialB acknowledges the videos provoke political reactions: \"I could put stuff up and there would be like 50-year-olds and 60-year-olds in the comments raging and saying all this political stuff.\" But he suggests some of the comments are ironic.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">Other users have objected to this wave of AI slop videos as an unfair racial stereotype of their neighbourhood. One black TikTok user from Croydon called C.Tino posted a response, saying the trend falsely portrayed the area as \"ghetto\". </p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">\"These videos are making people think this is real life. It's becoming out of hand now,\" he said.</p></div></div></div><div class=\"sc-9cd5bb24-0 iLXgbm\" data-component=\"advertisement-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 fAzFNb\"><div class=\"sc-66bf5539-1 bJFWOK\" data-component=\"ad-slot\" data-testid=\"ad-unit\"><div class=\"dotcom-ad\" data-testid=\"dotcom-mid_3\" id=\"dotcom-mid_3\"></div></div></div></div></div><div class=\"sc-9cd5bb24-0 cJKYng\" data-component=\"subheadline-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 gmICnp\"><h2 class=\"sc-f98b1ad2-0 gXmhTb\">Distort reality</h2></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">RadialB says he was able to start making this content because of the \"huge jump\" in the quality and availability of AI tools. It \"hugely lowers the barrier for entry\" for anyone who wants to make \"fake stuff\", he says.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">He says a lot of the accounts re-sharing his posts are likely doing it for views and clicks - and in an effort to monetise the content on other platforms like Facebook.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">Users as far away as Israel and Brazil said they shared the videos because they \"got engagement\" or to \"join in on the trend\". Several other accounts posting in Arabic, and that appear to be based in the Middle East, have also shared multiple videos about London being in decline - including the ones of Croydon.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">I have also found several TikTok profiles that purport to be British news accounts, which only share either these kinds of AI-generated videos about London or other negative content about cities in the UK and US.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">The deepfakes fit into an existing trend of videos presenting European and American cities as falling into urban decay because of crime and immigration. Sometimes they show real examples of phone-snatching, homelessness, graffiti or drug problems, but omit any wider context. </p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">Increasingly, though, they use AI to distort reality.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">South African YouTuber Kurt Caz has built an audience of more than four million subscribers by posting travel videos with titles such as \"Attacked by thieves in Barcelona!\" and \"Threatened in the UK's worst town!\"</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">But after posting a recent video, called \"Avoid this place in London\", he was accused of using AI to doctor the thumbnail to bolster his portrayal of the UK capital as one of \"the most messed up cities\" he has ever been to.</p></div></div></div><div class=\"sc-9cd5bb24-0 hoFfRa\" data-component=\"image-block\"><figure class=\"sc-cd6075cf-0 laOREU\"><div class=\"sc-82b3c53b-0 gmICnp\"><div class=\"sc-5340b511-1 cMIbKV\" data-testid=\"image\"><img aria-label=\"image unavailable\" class=\"sc-5340b511-0 gUePlo hide-when-no-script\" src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20260220-084609-e0c5de56b9-web-2.40.1-3/grey-placeholder.png\"/><img alt=\"Kurt Caz A still from Kurt Caz's video in Croydon, with the YouTuber looking across the street to a cyclist who is passing by, with two shops in the background. The shop's English text has been replaced by signs which appear to be Arabic, while the cyclist has a balaclava added to his image. Kurt Caz's own image has been edited to remove the thumbs-up gesture he made to the cyclist.\" class=\"sc-5340b511-0 hLdNfA\" loading=\"lazy\" sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/5569/live/38660c90-0e5f-11f1-801d-ed3cff6bf876.jpg.webp\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/5569/live/38660c90-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/5569/live/38660c90-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/5569/live/38660c90-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/5569/live/38660c90-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/5569/live/38660c90-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/5569/live/38660c90-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/5569/live/38660c90-0e5f-11f1-801d-ed3cff6bf876.jpg.webp 1536w\"/><span class=\"sc-5340b511-2 jVqbAn\">Kurt Caz</span></div></div><div class=\"sc-82b3c53b-0 gmICnp\"><figcaption class=\"sc-536eff7b-0 gnQokQ\">Arabic text was added to these shop signs and a balaclava placed on the friendly cyclist in this YouTube thumbnail</figcaption></div></figure></div><div class=\"sc-9cd5bb24-0 iLXgbm\" data-component=\"advertisement-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 fAzFNb\"><div class=\"sc-66bf5539-1 bJFWOK\" data-component=\"ad-slot\" data-testid=\"ad-unit\"><div class=\"dotcom-ad\" data-testid=\"dotcom-mid_4\" id=\"dotcom-mid_4\"></div></div></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">It showed a man on a bike in a balaclava, in front of shop signs written in Arabic. </p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">But in the video itself, the signs on Croydon's North End are in English, the cyclist has no balaclava and Caz is giving him the thumbs up after a friendly chat. </p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">On X, Kurt Caz dismissed criticism of the thumbnail as \"clickbait\" and said \"if you're going to do a hit piece on me do it properly\".</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">These ideas of the UK and Europe in decline have also been taken up by high-profile, influential figures, including X, Tesla and Space X owner Elon Musk, who spoke at far-right activist Tommy Robinson's Unite the Kingdom rally last year.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">\"What I see happening is a destruction of Britain. Initially a slow erosion, but a rapidly increasing erosion of Britain with massive uncontrolled migration,\" said Musk. It is a topic he regularly posts about on his X profile, with more than 230 million followers.</p></div></div></div><div class=\"sc-9cd5bb24-0 hoFfRa\" data-component=\"image-block\"><figure class=\"sc-cd6075cf-0 laOREU\"><div class=\"sc-82b3c53b-0 gmICnp\"><div class=\"sc-5340b511-1 cMIbKV\" data-testid=\"image\"><img aria-label=\"image unavailable\" class=\"sc-5340b511-0 gUePlo hide-when-no-script\" src=\"https://static.files.bbci.co.uk/bbcdotcom/web/20260220-084609-e0c5de56b9-web-2.40.1-3/grey-placeholder.png\"/><img alt=\"EPA A file picture of Elon Musk wearing a dark suit and a dark T-shirt, speaking in front of a bright blue background with the logo of the World Economic Forum in Davos.\" class=\"sc-5340b511-0 hLdNfA\" loading=\"lazy\" sizes=\"(min-width: 1280px) 50vw, (min-width: 1008px) 66vw, 96vw\" src=\"https://ichef.bbci.co.uk/news/480/cpsprodpb/614c/live/95373ab0-0e60-11f1-bbc2-b7e92c82a79f.jpg.webp\" srcset=\"https://ichef.bbci.co.uk/news/240/cpsprodpb/614c/live/95373ab0-0e60-11f1-bbc2-b7e92c82a79f.jpg.webp 240w,https://ichef.bbci.co.uk/news/320/cpsprodpb/614c/live/95373ab0-0e60-11f1-bbc2-b7e92c82a79f.jpg.webp 320w,https://ichef.bbci.co.uk/news/480/cpsprodpb/614c/live/95373ab0-0e60-11f1-bbc2-b7e92c82a79f.jpg.webp 480w,https://ichef.bbci.co.uk/news/640/cpsprodpb/614c/live/95373ab0-0e60-11f1-bbc2-b7e92c82a79f.jpg.webp 640w,https://ichef.bbci.co.uk/news/800/cpsprodpb/614c/live/95373ab0-0e60-11f1-bbc2-b7e92c82a79f.jpg.webp 800w,https://ichef.bbci.co.uk/news/1024/cpsprodpb/614c/live/95373ab0-0e60-11f1-bbc2-b7e92c82a79f.jpg.webp 1024w,https://ichef.bbci.co.uk/news/1536/cpsprodpb/614c/live/95373ab0-0e60-11f1-bbc2-b7e92c82a79f.jpg.webp 1536w\"/><span class=\"sc-5340b511-2 jVqbAn\">EPA</span></div></div><div class=\"sc-82b3c53b-0 gmICnp\"><figcaption class=\"sc-536eff7b-0 gnQokQ\">Elon Musk has promoted ideas of British decline</figcaption></div></figure></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">While there are legitimate debates to be had about immigration and crime, a lot of this content goes beyond the evidence available in reality.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">In January, pollster YouGov released new data suggesting a majority of Britons now believe London is unsafe, but only a third of people surveyed in the capital agreed - and 81% of them said their own local area was safe.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">But RadialB says his intention was not to become a \"decline porn\" influencer - and instead just wants to make people laugh with a sort of \"artform\" that games the recommendation systems. He appears to wash his hands of responsibility for how his content may be used or copied.</p></div></div></div><div class=\"sc-9cd5bb24-0 lmzibM\" data-component=\"text-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 IAFLu\"><p class=\"sc-9a00e533-0 eZyhnA\">His account on TikTok was banned for sharing content that was detected as graphic or inappropriate, he says. But he has now set up a new account sharing the same kinds of videos, showing \"roadmen\" at grubby \"infinity pools\" and \"taxpayer-funded buffets\".</p></div></div></div><div class=\"sc-9cd5bb24-0 hoFfRa\" data-component=\"tag-list-block\"><div class=\"sc-cd6075cf-0 DQtHs\"><div class=\"sc-82b3c53b-0 gDQlgg\"><div class=\"sc-6bf80075-0 lllwyY\"><div data-testid=\"anchor-inner-wrapper\"><a class=\"sc-57521d02-0 jsVxCb\" data-testid=\"internal-link\" href=\"/news/topics/c207p54m4pdt\">Social media</a></div><div data-testid=\"anchor-inner-wrapper\"><a class=\"sc-57521d02-0 jsVxCb\" data-testid=\"internal-link\" href=\"/news/topics/crm5plqk980t\">Deepfakes</a></div><div data-testid=\"anchor-inner-wrapper\"><a class=\"sc-57521d02-0 jsVxCb\" data-testid=\"internal-link\" href=\"/future/tags/technology\">Technology</a></div></div></div></div></div></article>",
    "word_count": 1293,
    "char_count": 7563,
    "language": "en"
}